Config/Documents/ТабельУчетаПосещаемостиСтудентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТабельУчетаПосещаемостиСтудентов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТабельУчетаПосещаемостиСтудентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факультет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСтудентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСтудентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТабеля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейВМесяце</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРабочихДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НевыходыПоДням</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Факультет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаСтудентов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыСтудентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНевыхода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНевыхода</Name>
							<Comment>1 - неоплачиваемый/ (-1) - оплачиваемый</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричиныНевыходов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НевыходыСводно</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Факультет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаСтудентов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыСтудентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеоплачиваемыеНевыходы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплачиваемыеНевыходы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричиныНевыходов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/Подразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Подразделения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВедетсяКассоваяКнига</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment> Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленнаяНумерацияДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Comment>Подразделение является обособленным</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганаФСГС</Name>
					<Comment>Код территориального органа государственной статистики </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/ТабельУчетаПосещаемостиСтудентов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ВидТабеля = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ТабельУчетаПосещаемостиСтудентов_ВидТабеля", "ВидТабеля", 0);
	
		Объект.НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
		Объект.КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
			
		Объект.КоличествоДнейВМесяце = День(Объект.КонецПериода);
		Объект.КоличествоРабочихДней = КоличествоРабочихДнейПериода(Объект.НачалоПериода, Объект.КонецПериода);
	КонецЕсли;
	
	Если Объект.ВидТабеля = 0 Тогда
		УстановитьУсловноеОформление();
	КонецЕсли;
	
	ТекВидТабеля = Объект.ВидТабеля;
	
	ТаблицаДнейМесяца();
		
	Если Не Параметры.Ключ.Пустая() И Объект.ВидТабеля = 0 Тогда
		ЗаполнитьДокумент();
	КонецЕсли;
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставление(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Отказ);
	
	Элементы.ГруппаНевыходыПоДням.Видимость = (Объект.ВидТабеля = 0);
	Элементы.ГруппаНевыходыСводно.Видимость = (Объект.ВидТабеля = 1);
	
	УстановитьВидимостьРеквизитов();
	УстановитьВидимостьКолонокДней();
	УстановитьПредупреждение();
	
	Если Объект.ВидТабеля = 0 Тогда
		ЗаполнитьСпискиВыбораКолонок();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ВидТабеля = 0 Тогда
		ТекущийОбъект.НевыходыПоДням.Очистить();
		
		Для Каждого Стр Из НевыходыПоДням Цикл
			Факультет = Стр.Факультет;
			ГруппаСтудентов = Стр.ГруппаСтудентов;
			Студент = Стр.Студент;
			ПричиныНевыходов = "";
			
			Для К = 1 По ТекущийОбъект.КоличествоДнейВМесяце Цикл
				Если Стр["Д" + К] = "Н(н)" Или Стр["Д" + К] = "Н(о)" Или Стр["Д" + К] = "х" Тогда
					ДатаНевыхода = Дата(Год(ТекущийОбъект.НачалоПериода), Месяц(ТекущийОбъект.НачалоПериода), К);
					ВидНевыхода = ?(Стр["Д" + К] = "Н(н)" Или Стр["Д" + К] = "х", 1, -1);
					ПричиныНевыходов = Стр.ПричиныНевыходов;
					
					Строка = ТекущийОбъект.НевыходыПоДням.Добавить();
					Строка.Факультет = Факультет;
					Строка.ГруппаСтудентов = ГруппаСтудентов;
					Строка.Студент = Студент;
					Строка.ДатаНевыхода = ДатаНевыхода;
					Строка.ВидНевыхода = ВидНевыхода;
					Строка.ПричиныНевыходов = ПричиныНевыходов;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ТабельУчетаПосещаемостиСтудентов_ВидТабеля", "ВидТабеля", Объект.ВидТабеля);
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПериодРегистрации_ИзменилсяПериодДокумента" 
		Или ИмяСобытия = "РаботаСоСтудентамиКлиент_ПроизведенВыборПериода" Тогда
		
		ОбработатьИзменениеНачалаПериода(Параметр);
		
		УстановитьВидимостьРеквизитов();
		УстановитьПредупреждение();
		
	КонецЕсли;

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидТабеляПриИзменении(Элемент)
	ТекТаблица = ?(ТекВидТабеля = 0, НевыходыПоДням, Объект.НевыходыСводно);
	
	Если ТекТаблица.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		ТекстСообщения = НСтр("ru='Текущая табличная часть будет очищена. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ИзменениеВидаТабеля", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаНевыходыПоДням.Видимость = (Объект.ВидТабеля = 0);
	Элементы.ГруппаНевыходыСводно.Видимость = (Объект.ВидТабеля = 1);
	
	Если Объект.ВидТабеля = 0 Тогда
		ТаблицаДнейМесяца();
		ЗаполнитьСпискиВыбораКолонок();
		УстановитьВидимостьКолонокДней();
		УстановитьУсловноеОформление();
	КонецЕсли;
	
	УстановитьВидимостьРеквизитов();
	УстановитьПредупреждение();
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаСтрокойПриИзменении(Элемент)
	Если Объект.ВидТабеля = 0 Тогда
		НевыходыПоДням.Очистить();
		Объект.НевыходыПоДням.Очистить();
	Иначе
		Объект.НевыходыСводно.Очистить();
	КонецЕсли;
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииПриИзменении(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Элемент);
	ОбработатьИзменениеНачалаПериода(Элемент);
	УстановитьПредупреждение();
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ВидТабеля = 0 Тогда
		НевыходыПоДням.Очистить();
		Объект.НевыходыПоДням.Очистить();
	Иначе
		Объект.НевыходыСводно.Очистить();
	КонецЕсли;
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииНачалоВыбора(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Элемент, СтандартнаяОбработка);
	
	ОбработатьИзменениеНачалаПериода(Элемент);
	
	УстановитьПредупреждение();
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Если Объект.ВидТабеля = 0 Тогда
		НевыходыПоДням.Очистить();
		Объект.НевыходыПоДням.Очистить();
	Иначе
		Объект.НевыходыСводно.Очистить();
	КонецЕсли;
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииРегулирование(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Элемент, Направление, СтандартнаяОбработка);
	ОбработатьИзменениеНачалаПериода(Элемент);
	УстановитьПредупреждение();
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	Если Объект.ВидТабеля = 0 Тогда
		НевыходыПоДням.Очистить();
		Объект.НевыходыПоДням.Очистить();
	Иначе
		Объект.НевыходыСводно.Очистить();
	КонецЕсли;
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииАвтоПодборТекста(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если Объект.ВидТабеля = 0 Тогда
		НевыходыПоДням.Очистить();
		Объект.НевыходыПоДням.Очистить();
	Иначе
		Объект.НевыходыСводно.Очистить();
	КонецЕсли;
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииОкончаниеВводаТекста(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ФакультетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТабЧасть = ?(Объект.ВидТабеля = 0, НевыходыПоДням, Объект.НевыходыСводно);
	
	Если ТабЧасть.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Событие", "Выбор");
		ДопПараметры.Вставить("Путь", "Справочник.Подразделения");
		ДопПараметры.Вставить("Элемент", Элемент);
		ДопПараметры.Вставить("ПараметрыФормы", Новый Структура("Владелец", Объект.Организация));
		
		ТекстСообщения = НСтр("ru='Текущая табличная часть будет очищена. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ЗапроситьОчисткуТабличнойЧасти", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФакультетПриИзменении(Элемент)
	УстановитьВидимостьРеквизитов();
	ТаблицаДнейМесяца();
	УстановитьВидимостьКолонокДней();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтудентовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТабЧасть = ?(Объект.ВидТабеля = 0, НевыходыПоДням, Объект.НевыходыСводно);
	
	Если Объект.ВидТабеля=0 ИЛИ ТабЧасть.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Событие", "Выбор");
		ДопПараметры.Вставить("Путь", "Справочник.ГруппыСтудентов");
		ДопПараметры.Вставить("Элемент", Элемент);
		ДопПараметры.Вставить("ПараметрыФормы", Новый Структура("Отбор", Новый Структура("Владелец", Объект.Факультет)));
		
		ТекстСообщения = НСтр("ru='Текущая табличная часть будет очищена. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ЗапроситьОчисткуТабличнойЧасти", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтудентовПриИзменении(Элемент)
	УстановитьВидимостьРеквизитов();
	ТаблицаДнейМесяца();
	УстановитьВидимостьКолонокДней();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтудентовОчистка(Элемент, СтандартнаяОбработка)
	
	ТабЧасть = ?(Объект.ВидТабеля = 0, НевыходыПоДням, Объект.НевыходыСводно);
	
	Если Объект.ВидТабеля=0 ИЛИ ТабЧасть.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Событие", "Очистка");
		ДопПараметры.Вставить("Путь", "Справочник.ГруппыСтудентов");
		ДопПараметры.Вставить("Элемент", Элемент);
		ДопПараметры.Вставить("ПараметрыФормы", Новый Структура("Отбор", Новый Структура("Владелец", Объект.Факультет)));
		
		ТекстСообщения = НСтр("ru='Текущая табличная часть будет очищена. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ЗапроситьОчисткуТабличнойЧасти", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТабЧасть = ?(Объект.ВидТабеля = 0, НевыходыПоДням, Объект.НевыходыСводно);
	
	Если ТабЧасть.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Событие", "Выбор");
		ДопПараметры.Вставить("Путь", "Справочник.Организации");
		ДопПараметры.Вставить("Элемент", Элемент);
		ДопПараметры.Вставить("ПараметрыФормы", Новый Структура);
		
		ТекстСообщения = НСтр("ru='Текущая табличная часть будет очищена. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ЗапроситьОчисткуТабличнойЧасти", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ТаблицаДнейМесяца();
	УстановитьВидимостьКолонокДней();
КонецПроцедуры

#Область ОбработчикиСобытийПодсистемыИнформационныеСсылки

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыНевыходыПоДням

&НаКлиенте
Процедура НевыходыПоднямПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НевыходыПоДнямПричиныНевыходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.НевыходыПоДням.ТекущиеДанные;
	
	Результат = "";
	Причины = ТекущиеДанные.ПричиныНевыходов;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Причины", Причины);
	ДопПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
	
	Оповещение = Новый ОписаниеОповещения("ВведенТекстПричинНепосещения", ЭтотОбъект, ДопПараметры);
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, Причины, "Введите причины непосещений");
КонецПроцедуры

&НаКлиенте
Процедура НевыходыПоДнямПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НевыходыПоДнямПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если ЗначениеЗаполнено(АдресЭлементаКоллекции) Тогда
		СравнитьСтроки(НевыходыПоДням.Индекс(Элемент.ТекущиеДанные));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НевыходыПоДнямПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	СоздатьОбразСтроки(НевыходыПоДням.Индекс(Элемент.ТекущиеДанные));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыНевыходыСводно

&НаКлиенте
Процедура НевыходыСводноПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НевыходыСводноПричиныНевыходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.НевыходыСводно.ТекущиеДанные;
	
	Результат = "";
	Причины = ТекущиеДанные.ПричиныНевыходов;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Причины", Причины);
	ДопПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
	
	Оповещение = Новый ОписаниеОповещения("ВведенТекстПричинНепосещения", ЭтотОбъект, ДопПараметры);
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, Причины, "Введите причины непосещений");
КонецПроцедуры

&НаКлиенте
Процедура НевыходыСводноПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаполнитьТабель(Команда)
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru='Не заполнен период документа, заполнение невозможно!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "НачалоПериодаСтрокой");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru='Не указана организация, заполнение невозможно!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Организация", "Объект");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Факультет) Тогда
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru='Не указан факультет, заполнение невозможно!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Факультет", "Объект");
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТабЧасть = ?(Объект.ВидТабеля = 0, НевыходыПоДням, Объект.НевыходыСводно);
	
	Если ТабЧасть.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Событие", "Перезаполнение");
		ДопПараметры.Вставить("Путь", "");
		ДопПараметры.Вставить("Элемент", Неопределено);
		ДопПараметры.Вставить("ПараметрыФормы", Новый Структура);
		
		ТекстСообщения = НСтр("ru='Текущая табличная часть будет очищена. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ЗапроситьОчисткуТабличнойЧасти", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидТабеля = 0 Тогда
		ЗаполнитьТабельПоДнямСервер();
	Иначе
		ЗаполнитьТабельСводноСервер();
	КонецЕсли;
	
	УстановитьПредупреждение();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ЗапроситьОчисткуТабличнойЧасти(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если Объект.ВидТабеля = 0 Тогда
			НевыходыПоДням.Очистить();
			Объект.НевыходыПоДням.Очистить();
		Иначе
			Объект.НевыходыСводно.Очистить();
		КонецЕсли;
		
		Если ДопПараметры <> Неопределено Тогда
			Событие = "";
			Путь = "";
			Элемент = Неопределено;
			ПараметрыФормы = Неопределено;
			
			ДопПараметры.Свойство("Событие", Событие);
			ДопПараметры.Свойство("Путь", Путь);
			ДопПараметры.Свойство("Элемент", Элемент);
			ДопПараметры.Свойство("ПараметрыФормы", ПараметрыФормы);
			
			Если Событие = "Выбор" Тогда
				ОткрытьФорму(Путь + ".ФормаВыбора", ПараметрыФормы, Элемент);
			ИначеЕсли Событие = "Очистка" Тогда
				Если Объект.ВидТабеля = 0 Тогда
					Объект.ГруппаСтудентов = Неопределено;
					ЗаполнитьТабельПоДнямСервер();
				КонецЕсли;					
			ИначеЕсли Событие = "Перезаполнение" Тогда
				Если Объект.ВидТабеля = 0 Тогда
					ЗаполнитьТабельПоДнямСервер();
				Иначе
					ЗаполнитьТабельСводноСервер();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
					
		УстановитьПредупреждение();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВведенТекстПричинНепосещения(Результат, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		ТекущиеДанные = Неопределено;
		ТекущиеПричины = "";
		
		ДопПараметры.Свойство("ТекущиеДанные", ТекущиеДанные);
		ДопПараметры.Свойство("ТекущиеПричины", ТекущиеПричины);
		
		Если Результат <> ТекущиеПричины Тогда
			ТекущиеДанные.ПричиныНевыходов = Результат;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеВидаТабеля(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ТекВидТабеля = 0 Тогда
			НевыходыПоДням.Очистить();
			Объект.НевыходыПоДням.Очистить();
		Иначе
			Объект.НевыходыСводно.Очистить();
		КонецЕсли;
		
		ТекВидТабеля = Объект.ВидТабеля;
	Иначе
		Объект.ВидТабеля = ТекВидТабеля;
	КонецЕсли;
	
	Элементы.ГруппаНевыходыПоДням.Видимость = (Объект.ВидТабеля = 0);
	Элементы.ГруппаНевыходыСводно.Видимость = (Объект.ВидТабеля = 1);
	
	Если Объект.ВидТабеля = 0 Тогда
		ТаблицаДнейМесяца();
		ЗаполнитьСпискиВыбораКолонок();
		УстановитьВидимостьКолонокДней();
		УстановитьУсловноеОформление();
	КонецЕсли;
	
	УстановитьВидимостьРеквизитов();
	УстановитьПредупреждение();
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьТабельСводноСервер()
	ТаблицаСтудентов = Документы.ТабельУчетаПосещаемостиСтудентов.ТаблицаСтудентов(Объект.НачалоПериода, Объект.КонецПериода, Объект.Организация, Объект.Факультет, Объект.ГруппаСтудентов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабСтудентов.Факультет КАК Факультет,
	               |	ТабСтудентов.ГруппаСтудентов КАК ГруппаСтудентов,
	               |	ТабСтудентов.Студент КАК Студент
	               |ПОМЕСТИТЬ ТаблицаСтудентов
	               |ИЗ
	               |	&ТабСтудентов КАК ТабСтудентов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабСтудентов.Факультет КАК Факультет,
	               |	ТабСтудентов.ГруппаСтудентов КАК ГруппаСтудентов,
	               |	ТабСтудентов.Студент КАК Студент,
				   |	0 КАК НеоплачиваемыеНевыходы,
				   |	0 КАК ОплачиваемыеНевыходы,
				   |	"""" КАК ПричиныНепосещений
	               |ИЗ
	               |	ТаблицаСтудентов КАК ТабСтудентов";
				   
	Запрос.УстановитьПараметр("ТабСтудентов", ТаблицаСтудентов);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Объект.НевыходыСводно.Загрузить(Результат);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабельПоДнямСервер()
	ТаблицаСтудентов = Документы.ТабельУчетаПосещаемостиСтудентов.ТаблицаСтудентов(Объект.НачалоПериода, Объект.КонецПериода, Объект.Организация, Объект.Факультет, Объект.ГруппаСтудентов);
	ТаблицаДнейМесяца = РеквизитФормыВЗначение("ДниМесяца");
	
	Результат = Документы.ТабельУчетаПосещаемостиСтудентов.ПолучитьПересечениеТаблиц(ТаблицаСтудентов, ТаблицаДнейМесяца);
	
	ЗначениеВРеквизитФормы(Результат, "НевыходыПоДням");
	
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокумент()
	ТаблицаСтудентов = Документы.ТабельУчетаПосещаемостиСтудентов.ТаблицаСтудентов(Объект.НачалоПериода, Объект.КонецПериода, Объект.Организация, Объект.Факультет, Объект.ГруппаСтудентов);
	ТаблицаДнейМесяца = РеквизитФормыВЗначение("ДниМесяца");
	
	Результат = Документы.ТабельУчетаПосещаемостиСтудентов.ПолучитьПересечениеТаблиц(ТаблицаСтудентов, ТаблицаДнейМесяца);
	
	Если Объект.НевыходыПоДням.Количество() > 0 Тогда
		Для Каждого Стр Из Результат Цикл
			Факультет = Стр.Факультет;
			ГруппаСтудентов = Стр.ГруппаСтудентов;
			Студент = Стр.Студент;
			
			Строки = Объект.НевыходыПоДням.НайтиСтроки(Новый Структура("Факультет,ГруппаСтудентов,Студент", Факультет, ГруппаСтудентов, Студент));
			
			Если Строки.Количество() > 0 Тогда
				Для Каждого Строка Из Строки Цикл
					ДеньНевыхода = День(Строка.ДатаНевыхода);
					ПричиныНевыходов = Строка.ПричиныНевыходов;
					
					Если Строка.ВидНевыхода = -1 И Стр["Д" + ДеньНевыхода] = "" Тогда
						Стр["Д" + ДеньНевыхода] = "Н(о)";
					ИначеЕсли Строка.ВидНевыхода = 1 И Стр["Д" + ДеньНевыхода] = "" Тогда
						Стр["Д" + ДеньНевыхода] = "Н(н)";
					КонецЕсли;
				КонецЦикла;
				
				Стр.ПричиныНевыходов = ПричиныНевыходов;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Результат, "НевыходыПоДням");
КонецПроцедуры

&НаСервереБезКонтекста
Функция КоличествоРабочихДнейПериода(Начало, Окончание, ГрафикРаботы = Неопределено)
	Возврат РодительскаяПлата.ПолучитьКоличествоРабочихДнейПоКалендарю(Начало, Окончание, ГрафикРаботы);
КонецФункции	

&НаКлиенте
Процедура УстановитьВидимостьРеквизитов()
	Если Объект.ВидТабеля = 0 Тогда
		Элементы.НевыходыПоДнямФакультет.Видимость = Не ЗначениеЗаполнено(Объект.Факультет);
		Элементы.НевыходыПоДнямГруппаСтудентов.Видимость = Не ЗначениеЗаполнено(Объект.ГруппаСтудентов);
	Иначе
		Элементы.НевыходыСводноФакультет.Видимость = Не ЗначениеЗаполнено(Объект.Факультет);
		Элементы.НевыходыСводноГруппаСтудентов.Видимость = Не ЗначениеЗаполнено(Объект.ГруппаСтудентов);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ТаблицаДнейМесяца()
	
	ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	КалендарныйГрафик = РаботаСоСтудентами.ПолучитьКалендарныйГрафикГруппы(Объект.ГруппаСтудентов, Объект.НачалоПериода);
	
	Элементы.КалендарныйГрафик.Видимость = ЗначениеЗаполнено(КалендарныйГрафик);
	Элементы.ПроизводственныйКалендарь.Видимость = НЕ ЗначениеЗаполнено(КалендарныйГрафик);
		
	Объект.КоличествоДнейВМесяце = День(Объект.КонецПериода);
	Объект.КоличествоРабочихДней = КоличествоРабочихДнейПериода(Объект.НачалоПериода, Объект.КонецПериода, КалендарныйГрафик);
	
	ТаблицаДней = Документы.ТабельУчетаПосещаемостиСтудентов.ТаблицаДнейМесяца(Объект.НачалоПериода, Объект.КонецПериода, Объект.КоличествоДнейВМесяце, 
																				Объект.КоличествоРабочихДней,КалендарныйГрафик);
	
	ДниМесяца.Очистить();
	
	Стр = ДниМесяца.Добавить();
	
	К = 1;
	
	Для Каждого Строка Из ТаблицаДней Цикл
		Стр["Д" + К] = Строка["Д" + К];
		
		Если Стр["Д" + К] = "В" Тогда
			Элементы["НевыходыПоДнямД" + К].ЦветТекстаЗаголовка = Новый Цвет(255, 0, 0);
			Элементы["НевыходыПоДнямД" + К].ЦветТекста = Новый Цвет(255, 0, 0);
			Элементы["НевыходыПоДнямД" + К].ТолькоПросмотр = Истина;
		Иначе
			Элементы["НевыходыПоДнямД" + К].ЦветТекстаЗаголовка = Новый Цвет(65, 48, 3);
			Элементы["НевыходыПоДнямД" + К].ЦветТекста = Новый Цвет(0, 0, 0);
			Элементы["НевыходыПоДнямД" + К].ТолькоПросмотр = Ложь;
		КонецЕсли;
		
		К = К + 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонокДней()
	Для К = 29 По 31 Цикл
		Элементы["НевыходыПоДнямД" + К].Видимость = (К <= День(Объект.КонецПериода));
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеНачалаПериода(Элемент)
	Объект.КонецПериода = КонецМесяца(Объект.НачалоПериода);
	ТаблицаДнейМесяца();
	УстановитьВидимостьКолонокДней();
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьПредупреждение()
	Если Объект.ВидТабеля = 0 Тогда
		Таблица = НевыходыПоДням;
	Иначе
		Таблица = Объект.НевыходыСводно;
	КонецЕсли;
	
	Если Таблица.Количество() > 0 Тогда
		Элементы.Организация.ОтображениеПредупрежденияПриРедактировании 				= ОтображениеПредупрежденияПриРедактировании.Отображать;
		Элементы.Дата.ОтображениеПредупрежденияПриРедактировании 						= ОтображениеПредупрежденияПриРедактировании.Отображать;
		Элементы.Факультет.ОтображениеПредупрежденияПриРедактировании					= ОтображениеПредупрежденияПриРедактировании.Отображать;
		Элементы.ВидТабеля.ОтображениеПредупрежденияПриРедактировании					= ОтображениеПредупрежденияПриРедактировании.Отображать;
	Иначе
		Элементы.Организация.ОтображениеПредупрежденияПриРедактировании 				= ОтображениеПредупрежденияПриРедактировании.НеОтображать;
		Элементы.Дата.ОтображениеПредупрежденияПриРедактировании 						= ОтображениеПредупрежденияПриРедактировании.НеОтображать;
		Элементы.Факультет.ОтображениеПредупрежденияПриРедактировании					= ОтображениеПредупрежденияПриРедактировании.НеОтображать;
		Элементы.ВидТабеля.ОтображениеПредупрежденияПриРедактировании					= ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	Для К = 1 По 31 Цикл
		ЭлементОформления = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
		
		Отбор = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НевыходыПоДням.Д"+К);
		Отбор.ПравоеЗначение = "х";
		Отбор.Использование = Истина;
		
		Оформление = ЭлементОформления.Оформление.Элементы;
		
		ЦветФона = Оформление.Найти("ЦветФона");
		ЦветФона.Значение =	ЦветаСтиля.ДатаГрафикаИзмененнаяФон;
		ЦветФона.Использование = Истина;
		
		Шрифт = Оформление.Найти("Шрифт");
		Шрифт.Значение = Новый Шрифт(,,Истина);
		Шрифт.Использование = Истина;
		
		ТолькоЧтение = Оформление.Найти("ТолькоПросмотр");
		ТолькоЧтение.Значение = Истина;
		ТолькоЧтение.Использование = Истина;
		
		Поля = ЭлементОформления.Поля.Элементы.Добавить();
		Поля.Использование = Истина;
		Поля.Поле = Новый ПолеКомпоновкиДанных("НевыходыПоДнямД"+К);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСпискиВыбораКолонок()
	Для К = 1 По 31 Цикл
		Если Элементы["НевыходыПоДнямД" + К].СписокВыбора.Количество() = 0 Тогда
			Элементы["НевыходыПоДнямД" + К].СписокВыбора.Добавить(" ", "посещение");
			Элементы["НевыходыПоДнямД" + К].СписокВыбора.Добавить("Н(н)", "Н(н)");
			Элементы["НевыходыПоДнямД" + К].СписокВыбора.Добавить("Н(о)", "Н(о)");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьОбразСтроки(НомерСтроки)
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(НевыходыПоДням[НомерСтроки]);
	
	ОбразСтроки = НевыходыПоДням.Выгрузить(МассивСтрок);
	
	АдресЭлементаКоллекции = ПоместитьВоВременноеХранилище(ОбразСтроки, ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура СравнитьСтроки(НомерСтроки)
	ОбразСтроки = ПолучитьИзВременногоХранилища(АдресЭлементаКоллекции);
	ТекущаяСтрока = НевыходыПоДням[НомерСтроки];
	
	Если ОбразСтроки <> Неопределено И ТекущаяСтрока <> Неопределено Тогда
		Для Каждого Колонка Из ОбразСтроки.Колонки Цикл
			Если ОбразСтроки[0][Колонка.Имя] <> ТекущаяСтрока[Колонка.Имя] Тогда
				Модифицированность = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	АдресЭлементаКоллекции = "";
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
